<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f9d10432cac2d0c4ec7451be8ab97e272e906666934fc2a5e305cdfb20c9a3f7","plan_job_ref":"Job Plan Airflow DAGs #3 at https://github.com/cal-itp/data-infra/actions/runs/14502763907","plan_out_hash":"5670c27aecc01ad6072e6beda6f6931679f312fae591904f5b26d1684a00ca77","plan_hash":"51943d4dfa2170903fc4d66cdba2d160149cbfa844a550773b79edfc8c15ffd7","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_services.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "1+6Yzg==" -> (known after apply)
!~      detect_md5hash      = "sGzoWDTMx3D+FeBre3jn9A==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "sGzoWDTMx3D+FeBre3jn9A==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fcreate_external_tables%2Fairtable%2Fexternal_airtable_transit_tech_stacks_services.yml?generation=1744830291306882&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_services.yml"
!~      output_name         = "dags/create_external_tables/airtable/external_airtable_transit_tech_stacks_services.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fcreate_external_tables%2Fairtable%2Fexternal_airtable_transit_tech_stacks_services.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #3](https://github.com/cal-itp/data-infra/actions/runs/14502763907)